RT-Thread/rt-thread/bsp/gd32/arm/libraries/GD32E50x_Firmware_Library/GD32E50x_standard_peripheral/Include/gd32e50x_rcu.h
/*!
    \file    gd32e50x_rcu.h
    \brief   definitions for the RCU

    \version 2023-12-31, V1.4.0, firmware for GD32E50x
*/

/*
    Copyright (c) 2023, GigaDevice Semiconductor Inc.

    Redistribution and use in source and binary forms, with or without modification,
are permitted provided that the following conditions are met:

    1. Redistributions of source code must retain the above copyright notice, this
       list of conditions and the following disclaimer.
    2. Redistributions in binary form must reproduce the above copyright notice,
       this list of conditions and the following disclaimer in the documentation
       and/or other materials provided with the distribution.
    3. Neither the name of the copyright holder nor the names of its contributors
       may be used to endorse or promote products derived from this software without
       specific prior written permission.

    THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS"
AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED
WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED.
IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE LIABLE FOR ANY DIRECT,
INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT
NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR
PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY,
WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE)
ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY
OF SUCH DAMAGE.
*/

#ifndef GD32E50X_RCU_H
#define GD32E50X_RCU_H

#include "gd32e50x.h"

/* RCU definitions */
#define RCU                             RCU_BASE

/* registers definitions */
#if defined(GD32E50X_HD)
#define RCU_CTL                         REG32(RCU + 0x00000000U)        /*!< control register */
#define RCU_CFG0                        REG32(RCU + 0x00000004U)        /*!< clock configuration register 0 */
#define RCU_INT                         REG32(RCU + 0x00000008U)        /*!< clock interrupt register */
#define RCU_APB2RST                     REG32(RCU + 0x0000000CU)        /*!< APB2 reset register */
#define RCU_APB1RST                     REG32(RCU + 0x00000010U)        /*!< APB1 reset register */
#define RCU_AHBEN                       REG32(RCU + 0x00000014U)        /*!< AHB enable register */
#define RCU_APB2EN                      REG32(RCU + 0x00000018U)        /*!< APB2 enable register */
#define RCU_APB1EN                      REG32(RCU + 0x0000001CU)        /*!< APB1 enable register */
#define RCU_BDCTL                       REG32(RCU + 0x00000020U)        /*!< backup domain control register */
#define RCU_RSTSCK                      REG32(RCU + 0x00000024U)        /*!< reset source / clock register */
#define RCU_CFG1                        REG32(RCU + 0x0000002CU)        /*!< clock configuration register 1 */
#define RCU_DSV                         REG32(RCU + 0x00000034U)        /*!< deep-sleep mode voltage register */
#define RCU_ADDCTL                      REG32(RCU + 0x000000C0U)        /*!< additional clock control register */
#define RCU_ADDINT                      REG32(RCU + 0x000000CCU)        /*!< additional clock interrupt register */
#define RCU_ADDAPB1RST                  REG32(RCU + 0x000000E0U)        /*!< APB1 additional reset register */
#define RCU_ADDAPB1EN                   REG32(RCU + 0x000000E4U)        /*!< APB1 additional enable register */
#define RCU_CFG2                        REG32(RCU + 0x000000D4U)        /*!< clock configuration register 2 */
#define RCU_ADDAPB1RST                  REG32(RCU + 0x000000E0U)        /*!< APB1 additional reset register */
#define RCU_ADDAPB1EN                   REG32(RCU + 0x000000E4U)        /*!< APB1 additional enable register */
#elif defined(GD32E50X_CL) || defined(GD32E508)
#define RCU_CTL                         REG32(RCU + 0x00000000U)        /*!< control register */
#define RCU_CFG0                        REG32(RCU + 0x00000004U)        /*!< clock configuration register 0 */
#define RCU_INT                         REG32(RCU + 0x00000008U)        /*!< clock interrupt register */
#define RCU_APB2RST                     REG32(RCU + 0x0000000CU)        /*!< APB2 reset register */
#define RCU_APB1RST                     REG32(RCU + 0x00000010U)        /*!< APB1 reset register */
#define RCU_AHBEN                       REG32(RCU + 0x00000014U)        /*!< AHB1 enable register */
#define RCU_APB2EN                      REG32(RCU + 0x00000018U)        /*!< APB2 enable register */
#define RCU_APB1EN                      REG32(RCU + 0x0000001CU)        /*!< APB1 enable register */
#define RCU_BDCTL                       REG32(RCU + 0x00000020U)        /*!< backup domain control register */
#define RCU_RSTSCK                      REG32(RCU + 0x00000024U)        /*!< reset source / clock register */
#define RCU_AHBRST                      REG32(RCU + 0x00000028U)        /*!< AHB reset register */
#define RCU_CFG1                        REG32(RCU + 0x0000002CU)        /*!< clock configuration register 1 */
#define RCU_DSV                         REG32(RCU + 0x00000034U)        /*!< deep-sleep mode voltage register */
#define RCU_ADDCTL                      REG32(RCU + 0x000000C0U)        /*!< additional clock control register */
#define RCU_ADDCFG                      REG32(RCU + 0x000000C4U)        /*!< additional clock configuration register */
#define RCU_ADDINT                      REG32(RCU + 0x000000CCU)        /*!< additional clock interrupt register */
#define RCU_PLLSSCTL                    REG32(RCU + 0x000000D0U)        /*!< PLL clock spread spectrum control register */
#define RCU_CFG2                        REG32(RCU + 0x000000D4U)        /*!< clock configuration register 2 */
#define RCU_ADDAPB1RST                  REG32(RCU + 0x000000E0U)        /*!< APB1 additional reset register */
#define RCU_ADDAPB1EN                   REG32(RCU + 0x000000E4U)        /*!< APB1 additional enable register */
#elif defined(GD32EPRT)
#define RCU_CTL                         REG32(RCU + 0x00000000U)        /*!< control register */
#define RCU_CFG0                        REG32(RCU + 0x00000004U)        /*!< clock configuration register 0 */
#define RCU_INT                         REG32(RCU + 0x00000008U)        /*!< clock interrupt register */
#define RCU_APB2RST                     REG32(RCU + 0x0000000CU)        /*!< APB2 reset register */
#define RCU_APB1RST                     REG32(RCU + 0x00000010U)        /*!< APB1 reset register */
#define RCU_AHBEN                       REG32(RCU + 0x00000014U)        /*!< AHB1 enable register */
#define RCU_APB2EN                      REG32(RCU + 0x00000018U)        /*!< APB2 enable register */
#define RCU_APB1EN                      REG32(RCU + 0x0000001CU)        /*!< APB1 enable register */
#define RCU_BDCTL                       REG32(RCU + 0x00000020U)        /*!< backup domain control register */
#define RCU_RSTSCK                      REG32(RCU + 0x00000024U)        /*!< reset source / clock register */
#define RCU_AHBRST                      REG32(RCU + 0x00000028U)        /*!< AHB reset register */
#define RCU_CFG1                        REG32(RCU + 0x0000002CU)        /*!< clock configuration register 1 */
#define RCU_DSV                         REG32(RCU + 0x00000034U)        /*!< deep-sleep mode voltage register */
#define RCU_ADDCTL                      REG32(RCU + 0x000000C0U)        /*!< additional clock control register */
#define RCU_ADDINT                      REG32(RCU + 0x000000CCU)        /*!< additional clock interrupt register */
#define RCU_PLLSSCTL                    REG32(RCU + 0x000000D0U)        /*!< PLL clock spread spectrum control register */
#define RCU_CFG2                        REG32(RCU + 0x000000D4U)        /*!< clock configuration register 2 */
#define RCU_ADDAPB1RST                  REG32(RCU + 0x000000E0U)        /*!< APB1 additional reset register */
#define RCU_ADDAPB1EN                   REG32(RCU + 0x000000E4U)        /*!< APB1 additional enable register */
#endif /* GD32E50X_HD */

